# Pandas: Exercise

This is an exercise that is intended to complement the script. Idea is that students go through the script and then try to apply the learned content.

Though one possible solution will be provided it is important to note that there might be multiple approaches to achieve the same.

In [1]:
#from IPython.core.display import HTML
#HTML('<style>.input, .jp-InputArea {display: none !important}</style>')

## Panda Basics

Learning the basics of Pandas.

First import Numpy and Pandas.

In [2]:
import numpy as np
import pandas as pd

Load/Download the 'Titanic' data set from the following GitHub repo: https://raw.githubusercontent.com/mwaskom/seaborn-data/master/titanic.csv. A description of the data can be found here: https://www.kaggle.com/c/titanic/data

Use the `pd.read_csv()` function to do so.

In [3]:
df = pd.read_csv('https://raw.githubusercontent.com/mwaskom/seaborn-data/master/titanic.csv')

Inspect the imported data frame: Print the first 5 rows of the data set.

In [4]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

Check the data types (dtypes) of the different columns, see how many non-null values there are per column.

In [5]:
df.dtypes

survived         int64
pclass           int64
sex             object
age            float64
sibsp            int64
parch            int64
fare           float64
embarked        object
class           object
who             object
adult_male        bool
deck            object
embark_town     object
alive           object
alone             bool
dtype: object

In [6]:
df.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

Remove all entries where the age is unknonw and then select the columns `age`, `sex` `pclass`, and `survived` and assign it to a separate variable.

In [8]:
# Median Age of all passangers
df_sub = df[df['age'].notna()]
# df.dropna(subset=['age'])   Alternative to .notna() 

df_sub = df_sub[['age', 'sex', 'pclass', 'survived', 'fare']]
df_sub

      age     sex  pclass  survived     fare
0    22.0    male       3         0   7.2500
1    38.0  female       1         1  71.2833
2    26.0  female       3         1   7.9250
3    35.0  female       1         1  53.1000
4    35.0    male       3         0   8.0500
..    ...     ...     ...       ...      ...
885  39.0  female       3         0  29.1250
886  27.0    male       2         0  13.0000
887  19.0  female       1         1  30.0000
889  26.0    male       1         1  30.0000
890  32.0    male       3         0   7.7500

[714 rows x 5 columns]

Select the fourth and fifth row, but display only columns age and sex.

In [9]:
df_sub.iloc[3:5, :2]

    age     sex
3  35.0  female
4  35.0    male

Now calculate:
* The median age of all passangers
* The share of passangers per class (`pclass`)
* The average age of all males, females
* The average age for all males, females, but this time per class 
* The average fare paid by all passangers between 50 and 60

In [10]:
# Median age of all passangers
df_sub['age'].median()

28.0

In [11]:
# Share of passangers per class
df_sub['pclass'].value_counts() / df_sub['pclass'].shape

3    0.497199
1    0.260504
2    0.242297
Name: pclass, dtype: float64

In [12]:
# Average age of all males, females
df_sub.groupby(['sex']).mean()['age']
# df_sub.groupby(['sex'])['age'].mean()

sex
female    27.915709
male      30.726645
Name: age, dtype: float64

In [13]:
# Average age of all males, females by class
df_sub.groupby(['sex', 'pclass']).mean()['age']

sex     pclass
female  1         34.611765
        2         28.722973
        3         21.750000
male    1         41.281386
        2         30.740707
        3         26.507589
Name: age, dtype: float64

In [14]:
df_sub[(df_sub['age'] > 50) & (df_sub['age'] < 60)]['fare'].mean()

43.69846578947369